{
  "users": [
    {
      "name": "emo",
      "username": "emoto",
      "password": "re12+fjk",
      "gender": "Male",
      "role": "Admin",
      "imgUrl": "https://imgs.search.brave.com/rqBQ7uBVTUUQSqq4Ub2AULJzD3_c78hVRPODo93Gm5U/rs:fit:478:225:1/g:ce/aHR0cHM6Ly90c2Uy/Lm1tLmJpbmcubmV0/L3RoP2lkPU9JUC55/QjFxRUdUR2c1R09I/M2FOdG8yS1Z3SGFI/VyZwaWQ9QXBp",
      "short_description": "short and fat but happy",
      "status": "Active",
      "date": "2022-3-19/11:51:53",
      "lastModification": "2022-3-29/21:23:57",
      "favorite": [],
      "id": 8
    },
    {
      "name": "Hristo",
      "username": "Hristoyan",
      "password": "passWord123",
      "gender": "Male",
      "role": "Admin",
      "imgUrl": "https://imgs.search.brave.com/QZ6S-ifL-cSBgMl2tpMdBS0wsBZ8if5S953B8idVnsg/rs:fit:420:225:1/g:ce/aHR0cHM6Ly90c2U0/Lm1tLmJpbmcubmV0/L3RoP2lkPU9JUC5t/VERLMjdQbmRnNnFW/eVFtY0pRWDRRQUFB/QSZwaWQ9QXBp",
      "short_description": "that's me",
      "status": "Active",
      "date": "2022-3-22/21:10:47",
      "lastModification": "2022-3-22/21:10:47",
      "favorite": [
        1,
        4,
        5
      ],
      "id": 18
    },
    {
      "name": "Martina",
      "username": "Martito",
      "password": "passwodr123+",
      "gender": "Female",
      "role": "Admin",
      "imgUrl": "https://imgs.search.brave.com/UhR0mXJ7ODwiElw02tUz8iZS0v1RMt3QxmMXiiFq70M/rs:fit:489:225:1/g:ce/aHR0cHM6Ly90c2Uz/Lm1tLmJpbmcubmV0/L3RoP2lkPU9JUC5U/NFFlb3Y3WUgxM3BY/bk1HQ2FlVUlRSGFI/TCZwaWQ9QXBp",
      "short_description": "angry and stuborn",
      "status": "Active",
      "date": "2022-3-22/21:13:50",
      "lastModification": "2022-3-29/21:22:37",
      "favorite": [],
      "id": 19
    },
    {
      "name": "kiro",
      "username": "kiroto",
      "password": "re12+fjk",
      "gender": "Male",
      "role": "Seller",
      "imgUrl": "https://imgs.search.brave.com/9iEa5GKW7YlkzxhvK3uxShAZnMEyPmg_5Rxzp8y90E4/rs:fit:474:225:1/g:ce/aHR0cHM6Ly90c2Ux/Lm1tLmJpbmcubmV0/L3RoP2lkPU9JUC5Y/VlFodzN6V2tpenU2/TEdtRXZBbXF3SGFI/YSZwaWQ9QXBp",
      "short_description": "",
      "status": "Active",
      "date": "2022-3-29/11:52:29",
      "lastModification": "2022-3-29/11:52:29",
      "favorite": [],
      "id": 20
    }
  ],
  "books": [
    {
      "seller": "emoto",
      "sellerId": 8,
      "condition": 4,
      "price": 10.99,
      "imgUrl": "http://books.google.com/books/content?id=AcI6_aBD17sC&printsec=frontcover&img=1&zoom=1&edge=curl&imgtk=AFLRE728FmcZDcV7i_lJjsKXvlIYEBbAXH6PFCP-w5h7g9sagQr6K-ttl6nVHcHeGg_TkBs58vN7mSxJpiffsBpYIUoJaADRVcDcMXnY280h2EFTJyO14zkX6UCXK6q6G1e6UNmCy7-9&source=gbs_api",
      "title": "Java for Artists",
      "authors": [
        "Rick Miller",
        "Raffi Kasparian"
      ],
      "publisher": "Pulp Free Press",
      "year": "2006",
      "categories": [
        "Computers / Programming / General"
      ],
      "description": "Java For Artists: The Art, Philosophy, and Science of Object-Oriented Programming is a Java programming language text/tradebook that targets beginner and intermediate Java programmers.",
      "id": 1
    },
    {
      "seller": "Hristoyan",
      "sellerId": 18,
      "condition": 4,
      "price": 11,
      "imgUrl": "http://books.google.com/books/content?id=4RChxt67lvwC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
      "title": "JavaScript",
      "authors": [
        "David Flanagan"
      ],
      "publisher": "O'Reilly Media, Inc.",
      "year": "2011-04-25",
      "categories": [
        "Computers"
      ],
      "description": "A revised and updated edition offers comprehensive coverage of ECMAScript 5 (the new JavaScript language standard) and also the new APIs introduced in HTML5, with chapters on functions and classes completely rewritten and updated to match current best practices and a new chapter on language extensions and subsets. Original.",
      "date": "2022-3-29/20:5:14",
      "lastModification": "2022-3-29/20:5:14",
      "id": 2
    },
    {
      "seller": "Hristoyan",
      "sellerId": 18,
      "condition": 3,
      "price": 10,
      "imgUrl": "http://books.google.com/books/content?id=nBuA0hmspdMC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
      "title": "Effective JavaScript",
      "authors": [
        "David Herman"
      ],
      "publisher": "Addison-Wesley",
      "year": "2012-11-26",
      "categories": [
        "Computers"
      ],
      "description": "It’s uncommon to have a programming language wonk who can speak in such comfortable and friendly language as David does. His walk through the syntax and semantics of JavaScript is both charming and hugely insightful; reminders of gotchas complement realistic use cases, paced at a comfortable curve. You’ll find when you finish the book that you’ve gained a strong and comprehensive sense of mastery.” —Paul Irish, developer advocate, Google Chrome “This is not a book for those looking for shortcuts; rather it is hard-won experience distilled into a guided tour. It’s one of the few books on JS that I’ll recommend without hesitation.” —Alex Russell, TC39 member, software engineer, Google In order to truly master JavaScript, you need to learn how to work effectively with the language’s flexible, expressive features and how to avoid its pitfalls. No matter how long you’ve been writing JavaScript code, Effective JavaScript will help deepen your understanding of this powerful language, so you can build more predictable, reliable, and maintainable programs.",
      "date": "2022-3-29/21:4:12",
      "lastModification": "2022-3-29/21:4:12",
      "id": 3
    },
    {
      "seller": "emoto",
      "sellerId": 8,
      "condition": 5,
      "price": 20,
      "imgUrl": "http://books.google.com/books/content?id=274fCwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
      "title": "Learning React Native",
      "authors": [
        "Bonnie Eisenman"
      ],
      "publisher": "\"O'Reilly Media, Inc.\"",
      "year": "2015-12-03",
      "categories": [
        "Computers"
      ],
      "description": "Get a practical introduction to React Native, the JavaScript framework for writing and deploying fully featured mobile apps that look and feel native. With this hands-on guide, you’ll learn how to build applications that target iOS, Android, and other mobile platforms instead of browsers. You’ll also discover how to access platform features such as the camera, user location, and local storage. With code examples and step-by-step instructions, author Bonnie Eisenman shows web developers and frontend engineers how to build and style interfaces, use mobile components, and debug and deploy apps. Along the way, you’ll build several increasingly sophisticated sample apps with React Native before putting everything together at the end. Learn how React Native provides an interface to native UI components Examine how the framework uses native components analogous to HTML elements Create and style your own React Native components and applications Install modules for APIs and features not supported by the framework Get tools for debugging your code, and for handling issues outside of JavaScript Put it all together with the Zebreto effective-memorization flashcard app Deploy apps to the iOS App Store and Google’s Play Store",
      "date": "2022-3-30/0:15:22",
      "lastModification": "2022-3-30/0:15:22",
      "id": 4
    },
    {
      "seller": "emoto",
      "sellerId": 8,
      "condition": 2,
      "price": 5,
      "imgUrl": "http://books.google.com/books/content?id=mj-eAgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
      "title": "Time to React",
      "authors": [
        "Heidi Hardt"
      ],
      "publisher": "Oxford University Press",
      "year": "2014-01-03",
      "categories": [
        "Political Science"
      ],
      "description": "In conflict-affected regions, delays in international response can have life or death consequences. The speed with which international organizations react to crises affects the prospects for communities to re-establish peace. Why then do some international organizations take longer than others to answer calls for intervention? To answer this question and explore options for reform, Time to React builds on contemporary scholarship with original data on response rates and interview evidence from 50 ambassadors across four leading organizations (AU, EU, OAS and OSCE). The explanation for variation in speed ultimately lies in core differences in institutional cultures across organizations. Although wealth and capabilities can strengthen a peace operation, it is the unspoken rules and social networks of peace and security committees at these organizations that dictate the pace with which an operation is established. This book offers a first analysis of the critical importance of and conditions shaping timeliness of crisis response by international organizations.",
      "date": "2022-3-30/0:23:29",
      "lastModification": "2022-3-30/0:23:29",
      "id": 5
    },
    {
      "seller": "Hristoyan",
      "sellerId": 18,
      "condition": 2,
      "price": 7,
      "imgUrl": "http://books.google.com/books/content?id=thLgzQEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api",
      "title": "React Cookbook",
      "authors": [
        "David Griffiths",
        "Dawn Griffiths"
      ],
      "publisher": "O'Reilly Media",
      "year": "2021-08-31",
      "categories": [
        "Computers"
      ],
      "description": "React helps you create and work on an app in just a few minutes. But learning how to put all the pieces together is hard. How do you validate a form? Or implement a complex multistep user action without writing messy code? How do you test your code? Make it reusable? Wire it to a backend? Keep it easy to understand? The React Cookbook delivers answers fast. Many books teach you how to get started, understand the framework, or use a component library with React, but very few provide examples to help you solve particular problems. This easy-to-use cookbook includes the example code developers need to unravel the most common problems when using React, categorized by topic area and problem. You'll learn how to: Build a single-page application in React using a rich UI Create progressive web applications that users can install and work with offline Integrate with backend services such as REST and GraphQL Automatically test for accessibility problems in your application Secure applications with fingerprints and security tokens using WebAuthn Deal with bugs and avoid common functional and performance problems",
      "date": "2022-3-30/15:19:56",
      "lastModification": "2022-3-30/15:19:56",
      "id": 6
    }
  ]
}